type Page = {
    title?: string;
    description?: string;
    valueType?: 'slider' | 'rating';
    minValue?: number | string;
    maxValue?: number | string;
    component?: React.ReactNode;
};

export const pages: Record<number, Page> = {
    1: {},
    2: {
        title: 'עד כמה אתם מוכנים לקחת סיכונים?',
        description: `אנא השתמשו בסולם מ-0 עד 10, כאשר 0 פירושו שאתם "לחלוטין לא מוכנים לקחת סיכונים" ו-10 פירושו שאתם "מוכנים מאוד לקחת סיכונים".`,
        minValue: 'לא מוכנים לחלוטין לקחת סיכונים',
        maxValue: 'מוכנים מאוד לקחת סיכונים',
        valueType: 'rating'
    },
    3: {},
    4: {
        title: 'עד כמה אתה מוכן לוותר על משהו שמועיל לך היום כדי להפיק מכך תועלת רבה יותר בעתיד?',
        description: `אנא ציין שוב את תשובתך בסולם מ-0 עד 10, כאשר 0 פירושו שאתה "לא מוכן לעשות זאת לחלוטין" ו-10 מציין שאתה "מאוד מוכן לעשות זאת".`,
        minValue: 'לא מוכן לעשות זאת לחלוטין',
        maxValue: 'מוכן מאוד לעשות זאת',
        valueType: 'rating'
    },
    5: {
        title: 'אם תזכה ב-1000$, כמה מהם היית תורם לצדקה?',
        minValue: 0,
        maxValue: 1000,
        valueType: 'slider'
    },
    6: {
        title: 'עד כמה אתה מוכן לתת למטרות טובות מבלי לצפות לתמורה? (סולם 0-10)',
        description: `אנא ציין שוב את תשובתך בסולם מ-0 עד 10, כאשר 0 פירושו שאתה "לא מוכן לעשות זאת לחלוטין" ו-10 פירושו שאתה "מאוד מוכן לעשות זאת".`,
        minValue: 'לא מוכן לעשות זאת לחלוטין',
        maxValue: 'מוכן מאוד לעשות זאת',
        valueType: 'rating'
    },
    7: {
        title: 'דמיינו שאתם מצוותים למשחק עם אדם אנונימי.',
        description: `שניכם מקבלים 20 דולר. אתם יכולים לשלוח כל חלק מ-$20 שלכם לאדם השני. אתם שולחים ראשונים. כל סכום שתשלחו לאדם השני ישלש את ערכו. לאחר מכן האדם השני יחליט כמה מהסכום שבידו לשלוח בחזרה אליכם. כמה הייתם בוחרים לשלוח? (0-20 $)`,
        minValue: 0,
        maxValue: 20,
        valueType: 'slider'
    },
    8: {
        title: 'באופן כללי, עד כמה אתם סומכים על אנשים אחרים שיחזירו טובה?',
        description: 'אנא ציינו שוב את תשובתכם בסולם מ-0 עד 10, כאשר 0 פירושו שאתם "בכלל לא סומכים" ו-10 פירושו שאתם "מאוד סומכים".',
        minValue: 'בכלל לא סומכים',
        maxValue: 'מאוד סומכים',
        valueType: 'rating'
    },
    9: {},
    10: {
        title: 'דמיינו לעצמכם את המצב הבא:',
        description: `יחד עם אדם שאינכם מכירים זכיתם בהגרלה ב-100$. הכללים קובעים את הדברים הבאים: אחד מכם צריך להציע הצעה כיצד לחלק את ה-100$ ביניכם. השני נחשף להצעה וצריך להחליט בין שתי אפשרויות. הוא או היא יכולים לקבל את ההצעה או לדחות אותה. אם הוא או היא מקבלים את ההצעה, הכסף מתחלק לפי ההצעה. אם הוא או היא דוחים את ההצעה, שניכם לא מקבלים דבר. אתם בתפקיד השולח! נא ציינו את הסכום שהייתם מעוניינים לשלוח לאדם השני.`,
        valueType: 'slider'
    },
    11: {},
    12: {
        title: 'עד כמה אתם מוכנים להעניש מישהו שמתנהג אליכם בצורה לא הוגנת, גם אם עלולות להיות לכם עלויות?',
        description: `אנא השתמשו בסולם מ-0 עד 10, כאשר 0 פירושו "אינכם מוכנים כלל לשאת בעלויות" כדי להעניש התנהגות בלתי הוגנת ו-10 פירושו "אתם מוכנים מאוד לשאת בעלויות" כדי להעניש התנהגות בלתי הוגנת `,
        minValue: 'לא מוכנים כלל לשאת בעלויות',
        maxValue: 'מוכנים מאוד לשאת בעלויות',
        valueType: 'rating'
    }
};
