export const data = [
    {
        id: 1,
        question: `מי זוכה במכירה פומבית מסוג "מחיר שני" (second price bid auction)?`,
        options: {
            A: 'המציע שהציע את ההצעה הגבוהה ביותר וזוכה בפריט במחיר הגבוה שהציע.',
            B: 'המציע שהציע את ההצעה השנייה בגובהה וזוכה בפריט במחיר ההצעה השנייה.',
            C: 'המציע שהציע את ההצעה השנייה בגובהה וזוכה בפריט במחיר ההצעה הגבוהה ביותר.',
            D: 'המציע שהציע את ההצעה הגבוהה ביותר וזוכה בפריט במחיר ההצעה השנייה בגובהה.'
        },
        correct_answer: 'D'
    },
    {
        id: 2,
        question: 'מהו התפקיד שלך במשחק זה?',
        options: {
            A: 'מציע במכירה פומבית.',
            B: 'מנהל המכירה הפומבית.',
            C: 'ספק מידע שמחזיק בידע על ערכו האמיתי של הפריט.',
            D: 'אף אחת מהתשובות אינה נכונה.'
        },
        correct_answer: 'A'
    },
    {
        id: 3,
        question: 'מה ההבדל בין שתי אפשרויות (אופציות) המכרז המוצגות בפניך בכל שלב?',
        options: {
            A: 'אין הבדל.',
            B: 'באחת כל המציעים מעריכים את הפריט באופן זהה, ובשנייה יש סט של הסתברויות להצעה השנייה בגובהה.',
            C: 'באחת אתה יודע כמה שווה הפריט עבורך ובשנייה אינך יודע.',
            D: 'באחת אתה בתפקיד של מציע ובשנייה בתפקיד של מנהל המכרז.'
        },
        correct_answer: 'B'
    },
    {
        id: 4,
        question: 'מה ידוע לך במכרז מסוג "הערכה זהה"?',
        options: {
            A: 'מספר המשתתפים.',
            B: 'ההערכה שלך לערך הפריט ולכן גם גובה ההצעה שלך.',
            C: 'סט ההסתברויות של ההצעות האפשריות השניות בגובהן.',
            D: 'ההערכה הפרטית של מנהל המכרז.'
        },
        correct_answer: 'B'
    },
    {
        id: 5,
        question: 'מה ידוע לך במכרז מסוג "סט הסתברויות"?',
        options: {
            A: 'מהי ההצעה השנייה בגובהה.',
            B: 'מספר המשתתפים.',
            C: 'סט ההסתברויות של ההצעות האפשריות השניות בגובהן.',
            D: 'ההערכה הפרטית של כל משתתף.'
        },
        correct_answer: 'C'
    },
    {
        id: 6,
        question: 'איזו מההצהרות הבאות נכונה?',
        options: {
            A: 'במכרז "הערכה זהה" תשלם את ההצעה המוצגת, ובמכרז "סט הסתברויות" תשלם לפי ההצעה השנייה בהתאם לסט ההסתברויות.',
            B: 'במכרז "הערכה זהה" תזכה בוודאות, ובמכרז "סט הסתברויות" לא תזכה.',
            C: 'במכרז "הערכה זהה" תשלם את ההצעה המוצגת, ובמכרז "סט הסתברויות" תשלם את הממוצע של ההצעות.',
            D: 'במכרז "הערכה זהה" תשלם את ההצעה המוצגת, ובמכרז "סט הסתברויות" תשלם את ההצעה הגבוהה ביותר המוצגת.'
        },
        correct_answer: 'A'
    },
    {
        id: 7,
        question: 'מהי המטרה שלך במשחק זה, וכיצד מחושב הציון בכל סיבוב?',
        options: {
            A: 'המטרה שלך היא למקסם את הרווח הצפוי שלך. הציון שלך הוא הרווח הצפוי של האפשרות שבחרת.',
            B: 'המטרה שלך היא למקסם את הרווח הצפוי שלך. אם תזכה, הרווח הוא ההערכה שלך פחות התשלום בפועל (ההצעה השנייה בתוספת דמי השתתפות אם יש).',
            C: 'המטרה שלך היא למקסם את הרווח הצפוי שלך. אם לא תזכה, לא תחויב בתשלום (אלא אם יש דמי השתתפות) ולא תקבל רווח.',
            D: `תשובות ב' וג' נכונות.`
        },
        correct_answer: 'D'
    },
    {
        id: 8,
        question: 'האם ייתכן רווח שלילי?',
        options: {
            A: 'לא, כי זה לא הגיוני.',
            B: 'כן, זה יכול לקרות כאשר יש דמי השתתפות, אתה זוכה, וההצעה השנייה שווה להערכתך.',
            C: 'כן, זה יכול לקרות כאשר יש דמי השתתפות, אתה זוכה, וההצעה השנייה בתוספת דמי ההשתתפות נמוכה מהערכתך.',
            D: 'לא, כי אתה זוכה רק אם ההערכה שלך שווה או גבוהה מההצעה השנייה, ולכן הרווח שלך חיובי. אם לא תזכה, לא תשלם.'
        },
        correct_answer: 'B'
    },
    {
        id: 9,
        question: `מדוע שמישהו יבחר <strong style='color: black; font-size: 1.08rem'>להשתתף</strong> במכרז מסוג "סט הסתברויות"?`,
        options: {
            A: 'כי במקרים מסוימים ייתכן רווח גבוה יותר מאשר במכרז מסוג "הערכה זהה".',
            B: 'כי אם לא תזכה, לא תשלם דבר ולא תרוויח דבר.',
            C: 'כי אתה מקבל סט של הצעות שניות במקום הצעה אחת קבועה.',
            D: 'כי במכרז "הערכה זהה" אתה תמיד מפסיד.'
        },
        correct_answer: 'A'
    },
    {
        id: 10,
        question: `מדוע שמישהו יבחר <strong style='color: black; font-size: 1.08rem'>לא להשתתף</strong> במכרז מסוג "סט הסתברויות"?`,
        options: {
            A: 'כי במקרים מסוימים ייתכן רווח גבוה יותר במכרז מסוג "הערכה זהה".',
            B: 'כי במקרים מסוימים תפסיד את המכרז ולא תרוויח דבר.',
            C: 'כי במקרים מסוימים ייתכן שהמכרז יוביל לרווח שלילי.',
            D: 'כל התשובות נכונות.'
        },
        correct_answer: 'D'
    }
];
